app/controllers/customers_controller.rb

  def index
    # svc = OData::Service.open('http://services.odata.org/V2/Northwind/Northwind.svc')
    # @customers = svc['CustomerDemographics']
    # svc = OData::Service.new('http://services.odata.org/V2/Northwind/Northwind.svc')
    # svc.Customers
    @customers = Customer.all
---
SELECT "customers".* FROM "customers"

  def show
    @customer = Customer.find(50)
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", 1]]